# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [8]:
import pandas as pd
import numpy as np

In [21]:
from numpy.random import randn
np.random.seed()

In [64]:
df = pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z V'.split())

In [65]:
df

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [66]:
df['W']

A    0.583659
B    0.903793
C   -0.711385
D   -0.737504
E   -0.157886
Name: W, dtype: float64

In [67]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.583659  0.987732
B  0.903793  0.012985
C -0.711385  1.415159
D -0.737504 -2.368714
E -0.157886 -0.389126

In [68]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.583659
B    0.903793
C   -0.711385
D   -0.737504
E   -0.157886
Name: W, dtype: float64

DataFrame Columns are just Series

In [69]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [70]:
df['new'] = df['W'] + df['Y']

In [71]:
df

          W         X         Y         Z         V       new
A  0.583659 -0.440430 -1.447708  0.987732  1.554917 -0.864049
B  0.903793  0.460135  0.823747  0.012985  1.214719  1.727539
C -0.711385  0.776793 -1.825414  1.415159 -0.909472 -2.536799
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273 -1.422161
E -0.157886  0.486394 -1.406256 -0.389126  0.619847 -1.564142

** Removing Columns**

In [72]:
df.drop('new',axis=1)

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [73]:
# Not inplace unless specified!
df

          W         X         Y         Z         V       new
A  0.583659 -0.440430 -1.447708  0.987732  1.554917 -0.864049
B  0.903793  0.460135  0.823747  0.012985  1.214719  1.727539
C -0.711385  0.776793 -1.825414  1.415159 -0.909472 -2.536799
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273 -1.422161
E -0.157886  0.486394 -1.406256 -0.389126  0.619847 -1.564142

In [74]:
df.drop('new',axis=1,inplace=True)

In [75]:
df

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

Can also drop rows this way:

In [76]:
df.drop('A')

          W         X         Y         Z         V
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [77]:
df

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

** Selecting Rows**

In [84]:
df.loc['A']

W    0.583659
X   -0.440430
Y   -1.447708
Z    0.987732
V    1.554917
Name: A, dtype: float64

Or select based off of position instead of label

In [85]:
df.iloc[2]

W   -0.711385
X    0.776793
Y   -1.825414
Z    1.415159
V   -0.909472
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [86]:
df.loc['B','Y']

0.823746785180878

In [89]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.583659 -1.447708
B  0.903793  0.823747

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [90]:
df

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [91]:
df>0

       W      X      Y      Z      V
A   True  False  False   True   True
B   True   True   True   True   True
C  False   True  False   True  False
D  False  False  False  False   True
E  False   True  False  False   True

In [92]:
df[df>0]

          W         X         Y         Z         V
A  0.583659       NaN       NaN  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C       NaN  0.776793       NaN  1.415159       NaN
D       NaN       NaN       NaN       NaN  0.669273
E       NaN  0.486394       NaN       NaN  0.619847

In [93]:
df[df['W']>0]

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719

In [94]:
df

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [96]:
df[df['W']>0]['Y']

A   -1.447708
B    0.823747
Name: Y, dtype: float64

In [97]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.447708 -0.440430
B  0.823747  0.460135

For two conditions you can use | and & with parenthesis:

In [98]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z, V]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [99]:
df

          W         X         Y         Z         V
A  0.583659 -0.440430 -1.447708  0.987732  1.554917
B  0.903793  0.460135  0.823747  0.012985  1.214719
C -0.711385  0.776793 -1.825414  1.415159 -0.909472
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
E -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [100]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z         V
0     A  0.583659 -0.440430 -1.447708  0.987732  1.554917
1     B  0.903793  0.460135  0.823747  0.012985  1.214719
2     C -0.711385  0.776793 -1.825414  1.415159 -0.909472
3     D -0.737504 -0.778487 -0.684657 -2.368714  0.669273
4     E -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [104]:
df.loc['A']

W    0.583659
X   -0.440430
Y   -1.447708
Z    0.987732
V    1.554917
Name: A, dtype: float64

In [111]:
newind = 'CA NY WY OR CO'.split()

In [112]:
df['States'] = newind

In [113]:
df

          W         X         Y         Z         V States
A  0.583659 -0.440430 -1.447708  0.987732  1.554917     CA
B  0.903793  0.460135  0.823747  0.012985  1.214719     NY
C -0.711385  0.776793 -1.825414  1.415159 -0.909472     WY
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273     OR
E -0.157886  0.486394 -1.406256 -0.389126  0.619847     CO

In [115]:
df.set_index('States')

               W         X         Y         Z         V
States
CA      0.583659 -0.440430 -1.447708  0.987732  1.554917
NY      0.903793  0.460135  0.823747  0.012985  1.214719
WY     -0.711385  0.776793 -1.825414  1.415159 -0.909472
OR     -0.737504 -0.778487 -0.684657 -2.368714  0.669273
CO     -0.157886  0.486394 -1.406256 -0.389126  0.619847

In [116]:
df

          W         X         Y         Z         V States
A  0.583659 -0.440430 -1.447708  0.987732  1.554917     CA
B  0.903793  0.460135  0.823747  0.012985  1.214719     NY
C -0.711385  0.776793 -1.825414  1.415159 -0.909472     WY
D -0.737504 -0.778487 -0.684657 -2.368714  0.669273     OR
E -0.157886  0.486394 -1.406256 -0.389126  0.619847     CO

In [117]:
df.set_index('States',inplace=True)

In [118]:
df

               W         X         Y         Z         V
States
CA      0.583659 -0.440430 -1.447708  0.987732  1.554917
NY      0.903793  0.460135  0.823747  0.012985  1.214719
WY     -0.711385  0.776793 -1.825414  1.415159 -0.909472
OR     -0.737504 -0.778487 -0.684657 -2.368714  0.669273
CO     -0.157886  0.486394 -1.406256 -0.389126  0.619847

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [140]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [141]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [142]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [143]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [144]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.544288 -0.721472
   2  0.635661  0.627244
   3 -0.011208  0.130000
G2 1 -0.187619 -0.441935
   2  1.512985  0.854052
   3  1.163002  1.039951

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [145]:
df.loc['G1']

          A         B
1  0.544288 -0.721472
2  0.635661  0.627244
3 -0.011208  0.130000

In [146]:
df.loc['G1'].loc[1]

A    0.544288
B   -0.721472
Name: 1, dtype: float64

In [153]:
df.index.names

FrozenList(['Group', 'Num'])

In [154]:
df.index.names = ['Group','Num']

In [155]:
df

                  A         B
Group Num
G1    1    0.544288 -0.721472
      2    0.635661  0.627244
      3   -0.011208  0.130000
G2    1   -0.187619 -0.441935
      2    1.512985  0.854052
      3    1.163002  1.039951

In [150]:
df.xs('G1')

            A         B
Num
1    0.544288 -0.721472
2    0.635661  0.627244
3   -0.011208  0.130000

In [151]:
df.xs(['G1',1])

A    0.544288
B   -0.721472
Name: (G1, 1), dtype: float64

In [156]:
df

                  A         B
Group Num
G1    1    0.544288 -0.721472
      2    0.635661  0.627244
      3   -0.011208  0.130000
G2    1   -0.187619 -0.441935
      2    1.512985  0.854052
      3    1.163002  1.039951

In [152]:
df.xs(1,level='Num')

              A         B
Group
G1     0.544288 -0.721472
G2    -0.187619 -0.441935

# Create DataFrame

A pandas DataFrame can be created using various inputs like 

1. Lists
2. dict
3. Series
4. Numpy ndarrays
5. Another DataFrame

### Create an Empty DataFrame

A basic DataFrame, which can be created is an Empty Dataframe.

In [162]:
#import the pandas library and aliasing as pd
import pandas as pd
df = pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

### 1. Create a DataFrame from Lists

The DataFrame can be created using a single list or a list of lists.

In [163]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print (df)

   0
0  1
1  2
2  3
3  4
4  5

In [164]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print (df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [165]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float) 
print (df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

***Note  Observe, the dtype parameter changes the type of Age column to floating point.***

### 2. Create a DataFrame from Dict of ndarrays / Lists

All the **ndarrays** must be of same length. If index is passed, then the length of the index should equal to the length of the arrays.

If no index is passed, then by default, index will be range(n), where n is the array length.

In [166]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print (df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

***Note  Observe the values 0,1,2,3. They are the default index assigned to each using the function range(n).***

In [167]:
#Let us now create an indexed DataFrame using arrays.
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print (df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

***Note  Observe, the index parameter assigns an index to each row.***

### 3. Create a DataFrame from List of Dicts

List of Dictionaries can be passed as input data to create a DataFrame. The dictionary keys are by default taken as column names.

In [168]:
#The following example shows how to create a DataFrame by passing a list of dictionaries.
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print (df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

***Note  Observe, NaN (Not a Number) is appended in missing areas.***

In [169]:
#The following example shows how to create a DataFrame by passing a list of dictionaries and the row indices.
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
print (df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [170]:
#The following example shows how to create a DataFrame with a list of dictionaries, row indices, and column indices. 
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])
print (df1)

        a   b
first   1   2
second  5  10

In [174]:
#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print (df2)

        a  b1
first   1 NaN
second  5 NaN

***Note  Observe, df2 DataFrame is created with a column index other than the dictionary key; thus, appended the NaNs in place. Whereas, df1 is created with column indices same as dictionary keys, so NaNs appended.***

### 4. Create a DataFrame from Dict of Series

Dictionary of Series can be passed to form a DataFrame. The resultant index is the union of all the series indexes passed.

In [179]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3, 5], index=['a', 'b', 'c', 'd']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df)

   one  two
a    1    1
b    2    2
c    3    3
d    5    4

***Note  Observe, for the series one, there is no label d passed, but in the result, for the d label, NaN is appended with NaN.***

### 1. Creating Pandas DataFrame from lists of lists.

In [14]:
# Import pandas library 
import pandas as pd 

# initialize list of lists 
data = [['tom', 10], ['nick', 15], ['juli', 14]] 

# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Name', 'Age']) 

# print dataframe. 
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

### 2. Creating DataFrame from dict of narray/lists

To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length.

In [15]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses. 

import pandas as pd 

# intialise data of lists. 
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]} 

# Create DataFrame 
df = pd.DataFrame(data) 

# Print the output. 
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

### 3. Creates a indexes DataFrame using arrays.

In [16]:
# Python code demonstrate creating 
# pandas DataFrame with indexed by 

# DataFrame using arrays. 
import pandas as pd 

# initialise data of lists. 
data = {'Name':['Tom', 'Jack', 'nick', 'juli'], 'marks':[99, 98, 95, 90]} 

# Creates pandas DataFrame. 
df = pd.DataFrame(data, index =['rank1', 'rank2', 'rank3', 'rank4']) 

# print the data 
df

       Name  marks
rank1   Tom     99
rank2  Jack     98
rank3  nick     95
rank4  juli     90

### 4. Creating Dataframe from list of dicts

Pandas DataFrame can be created by passing lists of dictionaries as a input data. By default dictionary keys taken as columns.

In [18]:
# Python code demonstrate how to create 
# Pandas DataFrame by lists of dicts. 
import pandas as pd 

# Initialise data to lists. 
data = [{'a': 1, 'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}] 

# Creates DataFrame. 
df = pd.DataFrame(data) 

# Print the data 
df

    a   b   c
0   1   2   3
1  10  20  30

Another example to create pandas DataFrame by passing lists of dictionaries and row indexes.

In [19]:
# Python code demonstrate to create 
# Pandas DataFrame by passing lists of 
# Dictionaries and row indices. 
import pandas as pd 

# Intitialise data of lists 
data = [{'b': 2, 'c':3}, {'a': 10, 'b': 20, 'c': 30}] 

# Creates padas DataFrame by passing 
# Lists of dictionaries and row index. 
df = pd.DataFrame(data, index =['first', 'second']) 

# Print the data 
df

           a   b   c
first    NaN   2   3
second  10.0  20  30

Another example to create pandas DataFrame from lists of dictionaries with both row index as well as column index.

In [20]:
# Python code demonstrate to create a 
# Pandas DataFrame with lists of 
# dictionaries as well as 
# row and column indexes. 

import pandas as pd 

# Intitialise lists data. 
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}] 

# With two column indices, values same 
# as dictionary keys 
df1 = pd.DataFrame(data, index =['first', 'second'], columns =['a', 'b']) 

# With two column indices with 
# one index with other name 
df2 = pd.DataFrame(data, index =['first', 'second'], columns =['a', 'b1']) 

# print for first data frame 
print (df1, "\n") 

# Print for second DataFrame. 
print (df2)

        a   b
first   1   2
second  5  10

        a  b1
first   1 NaN
second  5 NaN

### 5. Creating DataFrame using zip() function.

Two lists can be merged by using list(zip()) function. Now, create the pandas DataFrame by calling pd.DataFrame() function.

In [22]:
# Python program to demonstrate creating 
# pandas Datadaframe from lists using zip. 

import pandas as pd 

# List1 
Name = ['tom', 'krish', 'nick', 'juli'] 

# List2 
Age = [25, 30, 26, 22] 

# get the list of tuples from two lists. 
# and merge them by using zip(). 
list_of_tuples = list(zip(Name, Age)) 

# Assign data to tuples. 
list_of_tuples 


# Converting lists of tuples into 
# pandas Dataframe. 
df = pd.DataFrame(list_of_tuples, columns = ['Name', 'Age']) 

# Print data. 
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

### 6. Creating DataFrame from Dicts of series.

To create DataFrame from Dicts of series, dictionary can be passed to form a DataFrame. The resultant index is the union of all the series of passed indexed.

In [24]:
# Python code demonstrate creating 
# Pandas Dataframe from Dicts of series. 

import pandas as pd 

# Intialise data to Dicts of series. 
d = {'one' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd']), 
    'two' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd'])} 

# creates Dataframe. 
df = pd.DataFrame(d) 

# print the data. 
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40